tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "mongodb/brew"


# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

brew "git"
brew "rsync"
brew "gnupg"
brew "dockutil"
brew "wget"
brew "screen"
brew "binutils"
brew "coreutils"
brew "dcfldd"
brew "exiftool"
brew "ffmpeg"
brew "youtube-dl"


cask "visual-studio-code"
cask "sublime-text"
cask "brave-browser"
cask "google-chrome", args: { appdir: "~/Applications" }
cask "firefox"
cask "tor-browser"
cask "keepassx"
cask "keepassxc"
cask "raspberry-pi-imager"
cask "microsoft-teams"
cask "onedrive"
cask "binance"
cask "datagrip"
cask "intellij-idea"
cask "pycharm"
cask "whatsapp"



mas "WhatsApp", id: 1147396723
mas "WireGuard", id: 1451685025
mas "Microsoft Remote Desktop", id: 1295203466
mas "WiFi Explorer Lite", id: 1408727408


