tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "timescale/tap"


# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

brew "asciidoc"
brew "asciidoctor"
brew "bat"
brew "binutils"
brew "bitcoin"
brew "black"
brew "coreutils"
brew "dcfldd"
brew "ddrescue"
brew "docker"
brew "dockutil"
brew "exiftool"
brew "ffmpeg"
brew "flake8"
brew "git"
brew "gnupg"
brew "htop"
brew "imagemagick"
brew "mitmproxy"
brew "neofetch"
brew "node"
brew "pandoc"
brew "postgresql"
brew "pv"
brew "pylint"
brew "rsync"
brew "screen"
brew "tidy-html5"
brew "timescaledb"
brew "watson"
brew "wget"
brew "yt-dlp"
brew "zsh-autosuggestions" 
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

cask "adobe-digital-editions"
cask "anaconda"
cask "binance"
cask "brave-browser"
cask "calibre"
cask "citrix-workspace", args: { appdir: "~/Applications", require_sha: false }
cask "clion"
cask "datagrip"
cask "deltawalker"
cask "electrum"
cask "firefox"
cask "google-chrome", args: { appdir: "~/Applications", require_sha: false }
cask "intellij-idea"
cask "keepassxc"
cask "mactex"
cask "mark-text"
cask "mendeley-reference-manager"
cask "microsoft-office"
cask "microsoft-teams"
cask "miro", args: { appdir: "~/Applications", require_sha: false }
cask "openrefine"
cask "postman"
cask "pycharm"
cask "qbittorrent"
cask "raspberry-pi-imager"
cask "session"
cask "signal"
cask "spotify", args: { appdir: "~/Applications", require_sha: false }
cask "sqlitestudio"
cask "sublime-text"
cask "tor-browser"
cask "tradingview"
cask "visual-studio-code"
cask "whatsapp"
cask "wireshark"
cask "zoom"
cask "zotero"

mas "Microsoft Remote Desktop", id: 1295203466
mas "WiFi Explorer Lite", id: 1408727408
mas "WireGuard", id: 1451685025
